<a href="https://colab.research.google.com/github/Ghilmanzufar/Tugas_Pengatar_Sains_Data_1/blob/main/Pengenalan%20Dasar%20Library%20Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# TUGAS
# Pengenalan Dasar Library Pandas
Kelompok :

1.GHILMAN ZUFAR

2.MUHAMMAD DZULFIKAR

3.DAVIN APRILLIO SIANTURI

4.MUHAMMAD IMAM FIRDAUS

5.REZKY AGYA KINANTI

In [12]:
# import libraries
import numpy as np
import pandas as pd

In [13]:
# Membuat array "df" satu dimensi dengan Pandas
# nilainya [1,3,4,5]
df = pd.Series([1, 3, 4, 5])
print("Array satu dimensi:\n", df)

# Membuat dataframe dengan nilai berikut:
# 'Nama' : ['Andi', 'Budi', 'Dodo', 'Ema', 'Kari']
# 'Nilai' : [80, 20, 90, 40, 55]
# 'Kelas' : ['3B', '3A', '3B', '3B', '3A']
data = {
    'Nama' : ['Andi', 'Budi', 'Dodo', 'Ema', 'Kari'],
    'Nilai' : [80, 20, 90, 40, 55],
    'Kelas' : ['3B', '3A', '3B', '3B', '3A']
}
df = pd.DataFrame(data)


# Print seluruh baris pada kolom Nama
print("\nKolom Nama:\n", df['Nama'])

# Sortir data berdasarkan Nilai tertinggi ke Nilai terendah
df = df.sort_values('Nilai', ascending=False)
print("\nDataframe setelah diurutkan:\n", df)

Array satu dimensi:
 0    1
1    3
2    4
3    5
dtype: int64

Kolom Nama:
 0    Andi
1    Budi
2    Dodo
3     Ema
4    Kari
Name: Nama, dtype: object

Dataframe setelah diurutkan:
    Nama  Nilai Kelas
2  Dodo     90    3B
0  Andi     80    3B
4  Kari     55    3A
3   Ema     40    3B
1  Budi     20    3A

# Bermain dengan Real Data
1. Download data dari link berikut: https://www.kaggle.com/datasets/ruchi798/data-science-job-salaries/

2. Save ds_salaries.csv pada Google Drive

In [3]:
from google.colab import drive
import pandas as pd

drive.mount('/content/drive/')

Mounted at /content/drive/

In [4]:
# print 5 baris teratas
# print 5 baris terakhi

data = pd.read_csv('/content/drive/MyDrive/TUGAS_SEMESTER3_PSD/ds_salaries.csv')
print(data.head(5))
print(data.tail(5))

   Unnamed: 0  work_year experience_level employment_type  \
0           0       2020               MI              FT
1           1       2020               SE              FT
2           2       2020               SE              FT
3           3       2020               MI              FT
4           4       2020               SE              FT

                    job_title  salary salary_currency  salary_in_usd  \
0              Data Scientist   70000             EUR          79833
1  Machine Learning Scientist  260000             USD         260000
2           Big Data Engineer   85000             GBP         109024
3        Product Data Analyst   20000             USD          20000
4   Machine Learning Engineer  150000             USD         150000

  employee_residence  remote_ratio company_location company_size
0                 DE             0               DE            L
1                 JP             0               JP            S
2                 GB            50               GB            M
3                 HN             0               HN            S
4                 US            50               US            L
     Unnamed: 0  work_year experience_level employment_type      job_title  \
602         602       2022               SE              FT  Data Engineer
603         603       2022               SE              FT  Data Engineer
604         604       2022               SE              FT   Data Analyst
605         605       2022               SE              FT   Data Analyst
606         606       2022               MI              FT   AI Scientist

     salary salary_currency  salary_in_usd employee_residence  remote_ratio  \
602  154000             USD         154000                 US           100
603  126000             USD         126000                 US           100
604  129000             USD         129000                 US             0
605  150000             USD         150000                 US           100
606  200000             USD         200000                 IN           100

    company_location company_size
602               US            M
603               US            M
604               US            M
605               US            M
606               US            L

In [5]:
print(data.columns)

Index(['Unnamed: 0', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

In [6]:
# Tampilkan data baris ke 5-10 pada
# Tampilkan data baris ke 5-10 pada kolom job_title dan company_location
print(data.loc[5:10, ['job_title', 'company_location']])

                job_title company_location
5            Data Analyst               US
6     Lead Data Scientist               US
7          Data Scientist               HU
8   Business Data Analyst               US
9      Lead Data Engineer               NZ
10         Data Scientist               FR

In [7]:
# Hitung rata-rata salary_in_usd
average_salary = data['salary_in_usd'].mean()
print("Rata-rata salary_in_usd: ", average_salary)

Rata-rata salary_in_usd:  112297.86985172982

In [9]:
# Simpan data baris ke 5-20 ke bentuk .csv dengan nama "sparse.csv"
data.iloc[5:21].to_csv('sparse.csv')